//===========================================//
// 𝚄𝚜𝚎 𝙵𝚒𝚛𝚎𝚏𝚘𝚡 𝚊𝚜 𝚒𝚏 𝚒𝚝 𝚕𝚊𝚐𝚜 𝚘𝚗 𝚢𝚘𝚞𝚛 𝚍𝚎𝚟𝚒𝚌𝚎! //
//===========================================//

t /= V = 0.75,
P = 2**(6/12)
, 
// Pattern
G = 'KHKHSHSSHSKHKHS'[t/8192& 15]||''
, 
//======================//
//     𝚆𝚊𝚟𝚎 𝙷𝚎𝚕𝚙𝚎𝚛𝚜     //
//======================//

gS = t =>
    sin(
        t +
        sin(t*6/5) +
        sin(t/3*2.75)
    ), 

No = (t, m=1) =>
    gS(
        t/24 +
        gS(t/23)*4*gS(t/38) -
        gS(t/28)
    ) *
    gS(t/7) *
    cos(t*PI/m), 

//≈ー=ー=ー=ー=ー=ー=ー=ー≈//
// 𝚛𝚎𝚐𝚞𝚕𝚊𝚛  𝚒𝚗𝚜𝚝𝚛𝚞𝚖𝚎𝚗𝚝𝚜 //
//≈ー=ー=ー=ー=ー=ー=ー=ー≈//

Dr = t =>
    tanh(
        sin(
            tanh(t/40000)*90 +
            (1 - tanh(t/200)) * No(t/3,9)*3+
            gS(tanh(t/7000)*10)
        ) *
        (1 - tanh(t/3000)**5)
    ) *
    tanh(t/50)
, 
Hi = t =>
    No(t*PI/2,4) *
    (1 - tanh(t/2100)**2)
, 
Sn = t =>
    tanh(
        No(t/8,3) *
        No(t,8) *
        tanh(t/1500)**80 * 80 +

        gS(t/22 + gS(t/32)**7 * 8) *
        sin(t/32)**7+

        Dr(t*3)*3
    ) *
    (1 - tanh(t/4019)**8)
, 
Sna = t => Sn(t*2), 
Dru = t => Dr(t),
Hig = t => Hi(t*2)
, 
//======================//
//  𝙿𝚒𝚡𝚎𝚕 𝙸𝚗𝚜𝚝𝚛𝚞𝚖𝚎𝚗𝚝𝚜   //
//======================//

PxDr = t => sign(gS(tanh(t/8008)*100)+No(t,8)*(1-tanh(t/908))*3)*(1-tanh(t/2192)**8e2), 
PxSn = t =>sign(sin(sin(t/75)**3*No(t*(1-tanh(t/300008)**7), 30)*tanh(t/8888)**7*808+PxDr(t)*(t<6430))||0)*(1-tanh(t/1088)**8e13),
PxHi = (t, n, m) => sign(No(t/n, m)*(t<3000)),

PxDru = t => PxDr(t*2)/2, 
PxSna = t => PxSn(t*3)/2, 
PxHig = t => PxHi(t*2,2,2)/2, 

//======================//
//    𝙼𝚊𝚒𝚗 𝙵𝚞𝚗𝚌𝚝𝚒𝚘𝚗     //
//======================//

func =
//======================//
//     𝙳𝚛𝚞𝚖 𝚛𝚎𝚐𝚞𝚕𝚊𝚛     //
//======================//
[
    Hig(t%8192 * 7/5 * V * P) * ((G == 'H' ) + (G =='h') + (G=='×') + (G=='/')+(G=='&')+(G=='∆')) +
    (
        Dru((t%2**13) * V * P) * ((G == 'K') + (G == 'k') + (G=='-') + (G=='|')+(G=='&')+(G=='∆')) +
        Sna((t%2**13) * V * P) * ((G == 'S') + (G == 's')+ (G=='+') + (G=='/') + (G=='|') + (G=='&')
    ))
, 


//======================//
//      𝙿𝚒𝚡𝚎𝚕 𝙳𝚛𝚞𝚖𝚜     //
//======================//

    PxHig(t%8192 * 7/5 * V * P) * ((G == 'H' ) + (G =='h') + (G=='×') + (G=='/')+(G=='&')+(G=='∆')) +
    (
        PxDru((t%2**13) * V * P) * ((G == 'K') + (G == 'k') + (G=='-') + (G=='|')+(G=='&')+(G=='∆')) +
        PxSna((t%2**13) * V * P) * ((G == 'S') + (G == 's')+ (G=='+') + (G=='/') + (G=='|') + (G=='&')
    ))], 
//=======================//
// 𝚁𝚎𝚟𝚎𝚛𝚋 𝚂𝚎𝚝𝚞𝚙 (𝙴𝚏𝚏𝚎𝚌𝚝) //
//=======================//

Az = Array
, 
r = (i,g,C,V,S,P,W,M,e,I) => (

    L = 0,

    H = (s,b,x,y,z) =>
        L++ < b ? s(b,x,y,z) : L = 0,

    R = (d,t,l,s) => (
        t.push(Az(l - s*L).fill(0)),
        H(R,d,t,l,s)
    ),

    t
    ? 0
    : (
        O = Az(),
        p = Az(),
        s = Az(),

        R(C,O,V,S),
        R(P,p,W,M),
        R(P,s,W,M)
    ),

    // Comb
    F = d =>
        (O[L].shift() + H(F,d)),

    F(C),

    o = d =>
        (O[L].push(i - g*O[L][0]) + H(o,d)),

    o(C),

    c = d =>
        (O[L][O[L].length-1] + H(c,d)),

    // Allpass
    f = d => (
        p[L].shift(),
        p[L].push(L ? s[L-1][s[L-1].length-1] : c(C)),

        s[L].shift(),
        s[L].push(
            -g * p[L][p[L].length-1] +
            p[L][0] +
            g * s[L][0]
        ),

        H ( f , d )
    ),

    f ( P ),

    I * i + s [P] [ s [P]. length - 1] / C * e
), 
TR = (Set=0, Effect=0) => [(func[Set]), r(func[Set],.92,4,860,120,3,670,200,1,4)/4][Effect]
, 
//======================//
//     𝙵𝚒𝚗𝚊𝚕 𝙾𝚞𝚝𝚙𝚞𝚝     //
//======================//
TR(t>>18&1,1)